#+TITLE: simargs
#+DATE: 2023-10-21T12:04:40+0800
#+LASTMOD: 2024-08-17T19:03:45+0800
#+TYPE: docs
#+WEIGHT: 10
#+DESCRIPTION: A simple, opinionated, struct-based argument parser in Zig, taking full advantage of [[https://kristoff.it/blog/what-is-zig-comptime/][comptime]].

* Features
- Supported data type:
  - All [[https://ziglang.org/documentation/master/#Primitive-Types][primitive types]], such as =i8=, =f32=, =bool=
  - =[]const u8=
  - =Enum=
- Optional fields and fields with default value mean they are optional arguments
- Use =comptime= as possible as I can
- Provide =printHelp()= out of the box
- Support sub commands
* Usage
See [[https://github.com/jiacai2050/zigcli/blob/main/examples/simargs-demo.zig][simargs-demo.zig]].

#+begin_src bash :results verbatim :exports both
# Run demo
zig build run-simargs-demo -- -o /tmp/a.out --user-agent Firefox sub1 --a 123 hello world 2>&1
#+end_src

#+RESULTS:
#+begin_example
------------------------------Program------------------------------
/Users/jiacai/gh/zigcli/.zig-cache/o/bd8a4fb104779110e787d579f1d9c6f0/simargs-demo

------------------------------Arguments------------------------------
   verbose: null
user-agent: simargs-demo.main__struct_1700.main__struct_1700__enum_1707.Firefox
   timeout: 30
    output: /tmp/a.out
      help: false
__commands__: simargs-demo.main__struct_1700.main__struct_1700__union_1708{ .sub1 = simargs-demo.main__struct_1700.main__struct_1700__union_1708.main__struct_1700__union_1708__struct_1710{ .a = 123, .help = false } }

------------------------------Positionals------------------------------
1: hello
2: world

------------------------------print_help------------------------------
 USAGE:
     /Users/jiacai/gh/zigcli/.zig-cache/o/bd8a4fb104779110e787d579f1d9c6f0/simargs-demo [OPTIONS] [COMMANDS]

 COMMANDS:
  sub1       Subcommand 1
  sub2       Subcommand 2

 OPTIONS:
  -v, --verbose                    Make the operation more talkative
  -A, --user-agent STRING           (valid: Chrome|Firefox|Safari)(default: Firefox)
      --timeout INTEGER            Max time this request can cost(default: 30)
  -o, --output STRING              Write to file instead of stdout(required)
  -h, --help
#+end_example

* Acknowledgment
Blog post explaining how =simargs= is implemented: [[https://en.liujiacai.net/2022/12/14/argparser-in-zig/][What I learn by implementing argparser in Zig]].

When implement =simargs=, I refer following projects to learn how to write
idiomatic Zig code. Big Thanks!
- [[https://github.com/MasterQ32/zig-args/][MasterQ32/zig-args]]
- [[https://github.com/Hejsil/zig-clap][Hejsil/zig-clap]]
- [[https://github.com/evangrayk/zig-argparse][evangrayk/zig-argparse]]
